In [71]:
# Tabular data friends:
import pandas as pd
import numpy as np

# Data viz:
import matplotlib.pyplot as plt
import seaborn as sns

# Sklearn stuff:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import classification_report, confusion_matrix, plot_confusion_matrix
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
# my modules
import prepare as prep
import acquire as acq

import os

In [72]:
baseline = .62

In [119]:
sql_query = "select * from passengers"
directory = os.getcwd()
url_for_query = acq.get_db_url("titanic_db")
filename = "titanic_passangers.csv"

titanic = acq.get_sql_data(sql_query, directory, url_for_query, filename)

In [120]:
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [121]:
titanic = titanic.drop(columns=['embarked','class','deck'])

In [22]:
titanic.age.mode()

0    24.0
dtype: float64

In [122]:
titanic.age=titanic.age.fillna(24)

In [77]:
titanic.age.isna().value_counts()

False    891
Name: age, dtype: int64

In [123]:
dummy_df = pd.get_dummies(data=titanic[['sex','embark_town']], drop_first=True)
titanic = pd.concat([titanic, dummy_df], axis=1)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,male,22.0,1,0,7.2500,Southampton,0,1,0,1
1,1,1,1,female,38.0,1,0,71.2833,Cherbourg,0,0,0,0
2,2,1,3,female,26.0,0,0,7.9250,Southampton,1,0,0,1
3,3,1,1,female,35.0,1,0,53.1000,Southampton,0,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,Southampton,1,1,0,1

In [124]:
titanic_train, titanic_validate, titanic_test = prep.split_function(titanic, 'survived')

In [ ]:
#Explore section goes here but it's done

In [80]:
titanic_train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
455,455,1,3,male,29.0,0,0,7.8958,Cherbourg,1,1,0,0
380,380,1,1,female,42.0,0,0,227.5250,Cherbourg,1,0,0,0
492,492,0,1,male,55.0,0,0,30.5000,Southampton,1,1,0,1
55,55,1,1,male,24.0,0,0,35.5000,Southampton,1,1,0,1
243,243,0,3,male,22.0,0,0,7.1250,Southampton,1,1,0,1

In [81]:
X_train = titanic_train.drop(columns = ['survived','sex','passenger_id','embark_town', "sex_male"])

In [82]:
X_train.head()

,pclass,age,sibsp,parch,fare,alone,embark_town_Queenstown,embark_town_Southampton
455,3,29.0,0,0,7.8958,1,0,0
380,1,42.0,0,0,227.5250,1,0,0
492,1,55.0,0,0,30.5000,1,0,1
55,1,24.0,0,0,35.5000,1,0,1
243,3,22.0,0,0,7.1250,1,0,1

In [83]:
y_train = titanic_train.survived

In [84]:
X_validate = titanic_validate.drop(columns = ['survived','sex','passenger_id','embark_town',"sex_male"])
y_validate = titanic_validate.survived

In [85]:
X_test = titanic_test.drop(columns = ['survived','sex','passenger_id','embark_town',"sex_male"])
y_test = titanic_test.survived

In [86]:
#Model will include age but not sex of passenger 
logit1 = LogisticRegression()
logit1

LogisticRegression()

In [87]:
logit1.fit(X_train, y_train)

/Users/olivertaylor/opt/anaconda3/lib/python3.8/site-packages/sklearn/linear_model/_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [88]:
logit1.score(X_train, y_train)

0.7322097378277154

In [125]:
#try it agian with sex added 

X_train = titanic_train.drop(columns = ['survived','passenger_id','embark_town',"sex"])
y_train = titanic_train.survived

In [126]:
X_train.head()

,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
455,3,29.0,0,0,7.8958,1,1,0,0
380,1,42.0,0,0,227.5250,1,0,0,0
492,1,55.0,0,0,30.5000,1,1,0,1
55,1,24.0,0,0,35.5000,1,1,0,1
243,3,22.0,0,0,7.1250,1,1,0,1

In [127]:
X_validate = titanic_validate.drop(columns = ['survived','passenger_id','embark_town',"sex"])
y_validate = titanic_validate.survived

X_test = titanic_test.drop(columns = ['survived','passenger_id','embark_town',"sex"])
y_test = titanic_test.survived

In [128]:
logit2 = LogisticRegression()
logit2

LogisticRegression()

In [129]:
logit2.fit(X_train, y_train)

/Users/olivertaylor/opt/anaconda3/lib/python3.8/site-packages/sklearn/linear_model/_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [109]:
logit2.score(X_train, y_train)

0.8100558659217877

In [113]:
#again with embark towns removed 
X_train = titanic_train.drop(columns = ['survived','passenger_id','embark_town',"sex", "embark_town_Queenstown", "embark_town_Southampton"])
y_train = titanic_train.survived

In [114]:
X_train.head()

     pclass   age  sibsp  parch      fare  alone  sex_male
455       3  29.0      0      0    7.8958      1         1
380       1  42.0      0      0  227.5250      1         0
492       1  55.0      0      0   30.5000      1         1
55        1  24.0      0      0   35.5000      1         1
243       3  22.0      0      0    7.1250      1         1

In [115]:
X_validate = titanic_validate.drop(columns = ['survived','passenger_id','embark_town',"sex", "embark_town_Queenstown", "embark_town_Southampton"])
y_validate = titanic_validate.survived

In [67]:
X_train = titanic_test.drop(columns = ['survived','passenger_id','embark_town',"sex", "embark_town_Queenstown", "embark_town_Southampton"])
y_train = titanic_test.survived

In [116]:
logit3 = LogisticRegression()
logit3

LogisticRegression()

In [117]:
logit3.fit(X_train, y_train)

/Users/olivertaylor/opt/anaconda3/lib/python3.8/site-packages/sklearn/linear_model/_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [89]:
logit1.score(X_validate, y_validate)

0.7247191011235955

In [112]:
logit2.score(X_validate, y_validate)

0.8033707865168539

In [118]:
logit3.score(X_validate, y_validate)

0.7921348314606742

In [130]:
logit2.score(X_test, y_test)

0.7988826815642458